### Terragrunt Plan for `live/prod/test-app`
**Plan: 32 to add, 0 to change, 0 to destroy.**
<details><summary>Full Plan Output</summary>

```
time=2025-11-12T05:40:37Z level=info msg=Downloading Terraform configurations from file:///workspace into /workspace/live/prod/test-app/.terragrunt-cache/YC7akmpfFgEV3EpNvEYDmlQzGw0/iR00K09ud9CpNN9X6qOBki7MM4Y

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "~> 7.9.0"...
- Finding latest version of hashicorp/google-beta...
- Installing hashicorp/google v7.9.0...
- Installed hashicorp/google v7.9.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v7.11.0...
- Installed hashicorp/google-beta v7.11.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_client_config.default: Reading...
data.google_service_account_access_token.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/dev-iac-demo/regions/us-central1/zones/us-central1-a]
data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/prod-iac-deployer@prod-iac-demo.iam.gserviceaccount.com]
data.google_compute_network.main: Reading...
data.google_compute_subnetwork.main: Reading...
data.google_compute_subnetwork.main: Read complete after 0s [id=projects/sha-dmartinez-network/regions/us-central1/subnetworks/prod-us-central1]
data.google_compute_network.main: Read complete after 0s [id=projects/sha-dmartinez-network/global/networks/my-prod-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.frontend[0] will be created
  + resource "google_cloud_run_v2_service" "frontend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + default_uri_disabled    = true
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + labels                  = {
          + "application" = "test-app"
          + "environment" = "prod"
          + "team"        = "my-test-team"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "test-app-frontend"
      + observed_generation     = (known after apply)
      + project                 = "prod-iac-demo"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "test-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }

          + vpc_access {
              + egress = "ALL_TRAFFIC"

              + network_interfaces {
                  + network    = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
                  + subnetwork = "projects/sha-dmartinez-network/regions/us-central1/subnetworks/prod-us-central1"
                }
            }
        }
    }

  # google_compute_backend_service.frontend_backend[0] will be created
  + resource "google_compute_backend_service" "frontend_backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "test-app-frontend-backend"
      + port_name                       = (known after apply)
      + project                         = "prod-iac-demo"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }
    }

  # google_compute_global_address.external_ip[0] will be created
  + resource "google_compute_global_address" "external_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + labels             = {
          + "application" = "test-app"
          + "environment" = "prod"
          + "team"        = "my-test-team"
        }
      + name               = "test-app-external-lb-ip"
      + prefix_length      = (known after apply)
      + project            = "prod-iac-demo"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
    }

  # google_compute_global_forwarding_rule.external[0] will be created
  + resource "google_compute_global_forwarding_rule" "external" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "TCP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL_MANAGED"
      + name                  = "test-app-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "prod-iac-demo"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)
    }

  # google_compute_managed_ssl_certificate.default[0] will be created
  + resource "google_compute_managed_ssl_certificate" "default" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "test-app-ssl-cert"
      + project                   = "prod-iac-demo"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "test-app.demo.altostrat.com",
            ]
        }
    }

  # google_compute_region_network_endpoint_group.frontend_neg[0] will be created
  + resource "google_compute_region_network_endpoint_group" "frontend_neg" {
      + id                    = (known after apply)
      + name                  = "test-app-frontend-neg"
      + network               = (known after apply)
      + network_endpoint_type = "SERVERLESS"
      + project               = "prod-iac-demo"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "test-app-frontend"
        }
    }

  # google_compute_target_https_proxy.external[0] will be created
  + resource "google_compute_target_https_proxy" "external" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "test-app-https-proxy"
      + project            = "prod-iac-demo"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.external[0] will be created
  + resource "google_compute_url_map" "external" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "test-app-external-url-map"
      + project            = "prod-iac-demo"
      + self_link          = (known after apply)
    }

  # google_firestore_database.database[0] will be created
  + resource "google_firestore_database" "database" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + database_edition                  = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "test-app-firestore"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "prod-iac-demo"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_iam_member.user_group_roles["roles/cloudsql.viewer-user:admin@dmartinezg.altostrat.com"] will be created
  + resource "google_project_iam_member" "user_group_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:admin@dmartinezg.altostrat.com"
      + project = "prod-iac-demo"
      + role    = "roles/cloudsql.viewer"
    }

  # google_project_iam_member.user_group_roles["roles/datastore.viewer-user:admin@dmartinezg.altostrat.com"] will be created
  + resource "google_project_iam_member" "user_group_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:admin@dmartinezg.altostrat.com"
      + project = "prod-iac-demo"
      + role    = "roles/datastore.viewer"
    }

  # google_project_iam_member.user_group_roles["roles/iap.viewer-user:admin@dmartinezg.altostrat.com"] will be created
  + resource "google_project_iam_member" "user_group_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:admin@dmartinezg.altostrat.com"
      + project = "prod-iac-demo"
      + role    = "roles/iap.viewer"
    }

  # google_project_iam_member.user_group_roles["roles/pubsub.viewer-user:admin@dmartinezg.altostrat.com"] will be created
  + resource "google_project_iam_member" "user_group_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:admin@dmartinezg.altostrat.com"
      + project = "prod-iac-demo"
      + role    = "roles/pubsub.viewer"
    }

  # google_project_iam_member.user_group_roles["roles/redis.viewer-user:admin@dmartinezg.altostrat.com"] will be created
  + resource "google_project_iam_member" "user_group_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:admin@dmartinezg.altostrat.com"
      + project = "prod-iac-demo"
      + role    = "roles/redis.viewer"
    }

  # google_project_iam_member.user_group_roles["roles/run.viewer-user:admin@dmartinezg.altostrat.com"] will be created
  + resource "google_project_iam_member" "user_group_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:admin@dmartinezg.altostrat.com"
      + project = "prod-iac-demo"
      + role    = "roles/run.viewer"
    }

  # google_project_service.apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.apis["firestore.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "firestore.googleapis.com"
    }

  # google_project_service.apis["iam.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.apis["logging.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.apis["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "pubsub.googleapis.com"
    }

  # google_project_service.apis["redis.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "redis.googleapis.com"
    }

  # google_project_service.apis["run.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "run.googleapis.com"
    }

  # google_project_service.apis["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "servicenetworking.googleapis.com"
    }

  # google_project_service.apis["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.apis["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "vpcaccess.googleapis.com"
    }

  # google_project_service_identity.iap_sa will be created
  + resource "google_project_service_identity" "iap_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-iac-demo"
      + service = "iap.googleapis.com"
    }

  # google_pubsub_topic.main_topic[0] will be created
  + resource "google_pubsub_topic" "main_topic" {
      + effective_labels = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
      + id               = (known after apply)
      + labels           = {
          + "application" = "test-app"
          + "environment" = "prod"
          + "team"        = "my-test-team"
        }
      + name             = "test-app-topic"
      + project          = "prod-iac-demo"
      + terraform_labels = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
    }

  # google_redis_instance.cache[0] will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id     = (known after apply)
      + auth_enabled                = false
      + auth_string                 = (sensitive value)
      + authorized_network          = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
      + connect_mode                = "PRIVATE_SERVICE_ACCESS"
      + create_time                 = (known after apply)
      + current_location_id         = (known after apply)
      + effective_labels            = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
      + effective_reserved_ip_range = (known after apply)
      + host                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "application" = "test-app"
          + "environment" = "prod"
          + "team"        = "my-test-team"
        }
      + location_id                 = "us-central1-a"
      + maintenance_schedule        = (known after apply)
      + maintenance_version         = (known after apply)
      + memory_size_gb              = 1
      + name                        = "test-app-redis"
      + nodes                       = (known after apply)
      + persistence_iam_identity    = (known after apply)
      + port                        = (known after apply)
      + project                     = "prod-iac-demo"
      + read_endpoint               = (known after apply)
      + read_endpoint_port          = (known after apply)
      + read_replicas_mode          = (known after apply)
      + redis_version               = (known after apply)
      + region                      = (known after apply)
      + replica_count               = (known after apply)
      + reserved_ip_range           = (known after apply)
      + secondary_ip_range          = (known after apply)
      + server_ca_certs             = (known after apply)
      + terraform_labels            = {
          + "application"                = "test-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-test-team"
        }
      + tier                        = "BASIC"
      + transit_encryption_mode     = "DISABLED"
    }

  # google_service_account.frontend[0] will be created
  + resource "google_service_account" "frontend" {
      + account_id   = "test-app-frontend-sa"
      + disabled     = false
      + display_name = "Service Account for test-app frontend"
      + email        = "test-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:test-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "prod-iac-demo"
      + unique_id    = (known after apply)
    }

  # google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "prod-private-services-access",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # google_sql_database_instance.postgres[0] will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_14"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "test-app-pg"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "prod-iac-demo"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-central1"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-g1-small"
          + user_labels                 = {
              + "application" = "test-app"
              + "environment" = "prod"
              + "team"        = "my-test-team"
            }
          + version                     = (known after apply)

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = "ENCRYPTED_ONLY"
            }
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with google_iap_brand.default,
  on load-balancer.tf line 42, in resource "google_iap_brand" "default":
  42: resource "google_iap_brand" "default" {

This resource is deprecated on Jan 22, 2025. After Jan 19, 2026 the
`google_iap_brand` Terraform resource will no longer function as intended due
to the deprecation of the IAP OAuth Admin APIs. New projects will not be able
to use these APIs. March 19, 2026 The IAP OAuth Admin APIs will be
permanently shut down. Access to this feature will no longer be available.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
<!-- terragrunt-plan-for: live/prod/test-app -->